In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
names = ['Swagat','saswat','Pradeep','Bithika']
pd.DataFrame(names)

         0
0   Swagat
1   saswat
2  Pradeep
3  Bithika

In [5]:
names = ['swagat', 'saswat','pradeep','Bithika']
age = [13,24,53,59]
pd.DataFrame(zip(names,age))

         0   1
0   swagat  13
1   saswat  24
2  pradeep  53
3  Bithika  59

In [6]:
names = ['swagat','Bisal','pritish','Soumya']
age = [24,22,25,23]
dist = ['Mayurbhanj','Balasore','Puri','Keonjhar']
pd.DataFrame(zip(names,age,dist))

         0   1           2
0   swagat  24  Mayurbhanj
1    Bisal  22    Balasore
2  pritish  25        Puri
3   Soumya  23    Keonjhar

In [7]:
names = ['Swagat','saswat','pradeep','Bithika']
pd.DataFrame(names,columns=['Names'])

     Names
0   Swagat
1   saswat
2  pradeep
3  Bithika

In [8]:
names = ['swagat','Bisal','pritish','Soumya']
age = [24,22,25,23]
dist = ['Mayurbhanj','Balasore','Puri','Keonjhar']
pd.DataFrame(zip(names,age,dist),columns = ['Nmae','Age','Dist'])

      Nmae  Age        Dist
0   swagat   24  Mayurbhanj
1    Bisal   22    Balasore
2  pritish   25        Puri
3   Soumya   23    Keonjhar

In [9]:
names = ['swagat','Bisal','pritish','Soumya']
age = [24,22,25,23]
dist = ['Mayurbhanj','Balasore','Puri','Keonjhar']
col = ['Nmae','Age','Dist']
idx = ['A','B','C','D']
pd.DataFrame(zip(names,age,dist),columns = col,index = idx)

      Nmae  Age        Dist
A   swagat   24  Mayurbhanj
B    Bisal   22    Balasore
C  pritish   25        Puri
D   Soumya   23    Keonjhar

In [15]:
d ={'Names':['Swagat','Bisal','Pritish','Soumya'],
    'Age':[24,22,25,23],
    'Dist':['Mayurbhanj','Balasore','Puri','Keonjhar']}
d1 = pd.DataFrame(d)

In [16]:
d1.shape

(4, 3)

In [17]:
d1.head()

     Names  Age        Dist
0   Swagat   24  Mayurbhanj
1    Bisal   22    Balasore
2  Pritish   25        Puri
3   Soumya   23    Keonjhar

In [18]:
d1['Salary'] = [20000,10000,15000,7000]
d1

     Names  Age        Dist  Salary
0   Swagat   24  Mayurbhanj   20000
1    Bisal   22    Balasore   10000
2  Pritish   25        Puri   15000
3   Soumya   23    Keonjhar    7000